"""
Задача №3: Напишіть програму для друку літери Г
висотою 5 рядків за допомогою введеного користувачем символу.

Автор: Коваленко Катерина
"""

t = input("Введіть символ: ")

print(f"{t}{t}{t}{t}")
print(f"{t}")
print(f"{t}")
print(f"{t}")
print(f"{t}")
