"""
Задача №2: Тетянка полюбляє їздити у громадському транспорті, а отримуючи
квиток, відразу перевіряє, чи він щасливий. Квиток вважається щасливим,
якщо сума перших трьох цифр збігається з сумою останніх трьох цифр номера
квитка. Напишіть програму, яка перевірить рівність сум і виведе Happy, якщо
суми збігаються, і Ordinary, якщо суми різні. На вхід програмі подається рядок
із шести цифр.

Автор: Коваленко Катерина
"""


Номер = input("Назвіть шість цифр з яких складається Ваш квиток:")

Цифри = [int (цифра) for цифра in Номер]
if sum(Цифри[:3]) == sum(Цифри[3:]): print("Happy")
else: print("Ordinary")
