"""
Задача №2: Назвемо число паліндромом, якщо воно не змінюється при
перестановці його цифр у зворотному порядку. Напишіть програму,

яка за введеним користувачем числом n (1 ≤ n ≤ 100000) виводить
числа-паліндроми, які не перевищують n.

Автор: Коваленко Катерина
"""

def is_palindrome(num):
    # Перевіряємо, чи число є паліндромом
    return str(num) == str(num)[::-1]

def palindrome_numbers(n):
    # Виводимо числа-паліндроми до числа n
    for i in range(1, n + 1):
        if is_palindrome(i):
            print(i)

user_input = int(input("Введіть число n: "))
palindrome_numbers(user_input)



