"""
Задача №1: За даним цілим додатнім числом n обчисліть n! - значення
факторіалу цього числа.

Автор: Коваленко Катерина
"""

n = int(input("Напишіть ціле додатнє число!"))
f=1
for i in range(2, n+1):
    f=f*i
print(f)

    
