"""
Задача №2: Напишіть програму для розрахунку суми цифр у 4-цифровому цілому
числі, яке вводиться користувачем.

Автор: Коваленко Катерина
"""

число = float(input("Введіть 4-цифрове число"))
t = число//1000
f = (число%1000) // 100
a = (число%100) // 10
b = число%10

c = t+f+a+b

print(c)
