"""
Задача №1:В університеті використовується наступна шкала для інтерпретації
результатів тестування студентів: 90 балів і вище (A), 80-89 (B), 70- 79 (C),
60-69 (D), нижче 60 (F). Напишіть програму, яка дозволить студенту ввести
тестовий бал, а потім відобразити оцінку для цього балу.

Автор: Коваленко Катерина
"""

Бал = float(input ("Який Ващ бал?"))

if Бал>=90: Оцінка = "А"

if 80<=Бал<90: Оцінка = "B"

if 70<=Бал<80: Оцінка = "C"

if 60<=Бал<70: Оцінка = "D"

if Бал<60: Оцінка = "F"

print(f"Оцінка: {Оцінка}")
            
